Revit 2024 API
Document.OwnerFamily Property
Get the Family of this Family Document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Family OwnerFamily { get; }
Visual Basic
Public ReadOnly Property OwnerFamily As Family
	Get
Visual C++
public:
property Family^ OwnerFamily {
	Family^ get ();
}
Remarks
 Only available if the current document is family document.
Examples
CopyC#
string categoryName = familyDoc.OwnerFamily.FamilyCategory.Name;
CopyVB.NET
Dim categoryName As String = familyDoc.OwnerFamily.FamilyCategory.Name
See Also
Document Class
Autodesk.Revit.DB Namespace